# abz - list comprehension
# всегда создается новый список
print([*range(100)])  # тут не написать условие
print([i for i in range(100) if '3' in str(i)])  # тут можно


# ----------------------------------------------------------------------------------------------------------------------


# abz - Nested list comprehension
students_group = [["Anna", "John", "Liza", "Vlad"],
                  ["Mike", "April", "Bob", "Alice"],
                  ["Alex"]]

# for справа - первый, получает из листа группы, на выходе выдает группу
# for слева - второй, итерируется по студентам в группе, выдает конкатенируемое значение
print([[student + " - Python" for student in group] for group in students_group])


# --------------------------------------------------------------------------------------------------------------------